#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

To view this run in a browser, visit:
https://app.terraform.io/app/deploymenttheory/terraform-jamfpro-demo/runs/run-imh1d29t7qVPAd9W

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.jamfpro_package.jamfpro_package_002_data will be read during apply
  # (config refers to values not yet known)
 <= data "jamfpro_package" "jamfpro_package_002_data" {
      + id   = (known after apply)
      + name = (known after apply)
    }

  # jamfpro_macos_configuration_profile.jamfpro_macos_configuration_profile_001 will be destroyed
  # (because jamfpro_macos_configuration_profile.jamfpro_macos_configuration_profile_001 is not in configuration)
  - resource "jamfpro_macos_configuration_profile" "jamfpro_macos_configuration_profile_001" {
      - distribution_method = "Install Automatically" -> null
      - id                  = "1763" -> null
      - level               = "System" -> null
      - name                = "tf-ghatest-macosconfigprofile-accessibility-options" -> null
      - payload             = <<-EOT
            <?xml version="1.0" encoding="UTF-8"?>
            <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
            <plist version="1">
                <dict>
                    <key>PayloadType</key>
                    <string>Configuration</string>
                    <key>PayloadDisplayName</key>
                    <string>accessibility</string>
                    <key>PayloadDescription</key>
                    <string/>
                    <key>PayloadVersion</key>
                    <integer>1</integer>
                    <key>PayloadEnabled</key>
                    <true/>
                    <key>PayloadRemovalDisallowed</key>
                    <true/>
                    <key>PayloadScope</key>
                    <string>System</string>
                    <key>PayloadContent</key>
                    <array>
                        <dict>
                            <key>PayloadType</key>
                            <string>com.apple.universalaccess</string>
                            <key>PayloadDisplayName</key>
                            <string>Accessibility</string>
                            <key>PayloadDescription</key>
                            <string/>
                            <key>PayloadVersion</key>
                            <integer>1</integer>
                            <key>PayloadEnabled</key>
                            <true/>
                            <key>closeViewScrollWheelToggle</key>
                            <true/>
                            <key>closeViewHotkeysEnabled</key>
                            <true/>
                            <key>closeViewNearPoint</key>
                            <integer>10</integer>
                            <key>closeViewFarPoint</key>
                            <integer>1</integer>
                            <key>closeViewShowPreview</key>
                            <true/>
                            <key>closeViewSmoothImages</key>
                            <true/>
                            <key>whiteOnBlack</key>
                            <true/>
                            <key>grayscale</key>
                            <true/>
                            <key>contrast</key>
                            <integer>0</integer>
                            <key>mouseDriverCursorSize</key>
                            <integer>1</integer>
                            <key>voiceOverOnOffKey</key>
                            <true/>
                            <key>flashScreen</key>
                            <true/>
                            <key>stereoAsMono</key>
                            <true/>
                            <key>stickyKey</key>
                            <true/>
                            <key>stickyKeyBeepOnModifier</key>
                            <true/>
                            <key>stickyKeyShowWindow</key>
                            <true/>
                            <key>slowKey</key>
                            <true/>
                            <key>slowKeyBeepOn</key>
                            <true/>
                            <key>slowKeyDelay</key>
                            <integer>0</integer>
                            <key>mouseDriver</key>
                            <true/>
                            <key>mouseDriverInitialDelay</key>
                            <real>1.0</real>
                            <key>mouseDriverMaxSpeed</key>
                            <integer>3</integer>
                            <key>mouseDriverIgnoreTrackpad</key>
                            <false/>
                        </dict>
                    </array>
                </dict>
            </plist>
        EOT -> null
      - user_removeable     = false -> null

      - category {
          - id = -1 -> null
        }

      - scope {
          - all_computers      = false -> null
          - all_jss_users      = false -> null
          - building_ids       = [] -> null
          - computer_group_ids = [
              - 53,
            ] -> null
          - computer_ids       = [
              - 17,
              - 18,
            ] -> null
          - department_ids     = [] -> null
          - jss_user_group_ids = [
              - 4,
            ] -> null
          - jss_user_ids       = [
              - 4,
            ] -> null

          - exclusions {
              - building_ids        = [] -> null
              - computer_group_ids  = [] -> null
              - computer_ids        = [] -> null
              - department_ids      = [
                  - 27653,
                ] -> null
              - ibeacon_ids         = [] -> null
              - jss_user_group_ids  = [] -> null
              - jss_user_ids        = [] -> null
              - network_segment_ids = [] -> null
            }
        }
    }

  # jamfpro_package.jamfpro_package_002 will be created
  + resource "jamfpro_package" "jamfpro_package_002" {
      + allow_uninstalled             = false
      + boot_volume_required          = false
      + file_hash                     = (known after apply)
      + filename                      = (known after apply)
      + fill_existing_users           = true
      + fill_user_template            = true
      + id                            = (known after apply)
      + info                          = "tf package deployment for demonstration"
      + install_if_reported_available = false
      + name                          = "tf-ghatest-package-suspiciouspackage"
      + notes                         = "This package is used for Terraform provider documentation example."
      + os_requirements               = "macOS 10.15.7, macOS 11.1"
      + package_file_path             = "support_files/packages/SuspiciousPackage.dmg"
      + package_uri                   = (known after apply)
      + priority                      = 10
      + reboot_required               = false
      + reinstall_option              = "Do Not Reinstall"
      + required_processor            = "None"
      + send_notification             = true
      + switch_with_package           = "Do Not Install"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + jamfpro_package_002_data_id    = (known after apply)
  + jamfpro_package_002_data_name  = (known after apply)

Run status: planned and saved (confirmable)
Workspace is unlocked

```

</details>

*Pusher: @ShocOne, Action: `push`, Working Directory: `workload/terraform/jamfpro`, Workflow: `Create terraform plan`*